app/controllers/images_controller.rb

    def create
      @image = Image.new(image_params)

      if @image.save
---
INSERT INTO "images" ("file", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["file", nil], ["created_at", "2023-11-13 11:15:34.161443"], ["updated_at", "2023-11-13 11:15:34.161443"]]