app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def get
      user_id = params[:id]
      # render user_id


      requested_user = User.find_by(id: user_id)