app/controllers/users_controller.rb

SELECT 1 AS one FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "your_username15"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "your_email15@example.com"], ["LIMIT", 1]]
INSERT INTO "users" ("id", "username", "password_digest", "email", "first_name", "last_name", "created_at", "updated_at", "password_reset_token", "password_reset_token_expires_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def register
    if User.exists?(username: user_params[:username])
      render json: { error: 'Username is not unique' }, status: 400
      return
    end

    if User.exists?(email: user_params[:email])
      render json: { error: 'Email is not unique' }, status: 400
      return
    end

    encrypted_password = BCrypt::Password.create(user_params[:password])

    user = User.new(user_params)
    puts "this is user #{user.password}"
    if user.save

SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT 1 AS one FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
---
  def list
    page = params[:page].to_i

    per_page = 10

    offset=(page-1)*per_page

    users = User.limit(per_page).offset(offset)

    if users.empty?

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 15]]
---
  def delete

    delete_id = params[:id]
    # puts "Received user ID in delete action: #{user_id.inspect}"
    # puts "Received user ID in delete action: #{user_id}"

    requested_user = User.find_by(id: delete_id)

    if requested_user
      if current_user == requested_user.id
        requested_user.destroy

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "your_email2@example.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "password_reset_token" = ?, "password_reset_token_expires_at" = ? WHERE "users"."id" = ?  [["updated_at", "2023-11-09 11:08:41.133319"], ["password_reset_token", "[FILTERED]"], ["password_reset_token_expires_at", "[FILTERED]"], ["id", 2]]
---
  def forget_password
    email = params[:email]

    if email.blank?
      render json: {error: 'Email cannot be blank'}, status: 400
      return
    end

    user = User.find_by(email: email)

    if user

      token = SecureRandom.hex(20)
      user.update(password_reset_token: token, password_reset_token_expires_at: 1.hour.from_now)

SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = ? LIMIT ?  [["password_reset_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def reset_password
    token = params[:token]
    user = User.find_by(password_reset_token: token)

SELECT "users".* FROM "users" WHERE "users"."password_reset_token" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def reset_password_submit
    token = params[:token]
    user = User.find_by(password_reset_token: token)